#+MACRO: ts (eval(mwp-get-ts+7  'org-mwp-classtimes-calibrate 2))
#+STARTUP: customtime
#+ORG_LMS_COURSEID: 99251

* get student list (for GH roster)

#+begin_src emacs-lisp
(let* ((students 
        (org-lms-get-students))
        (emails (cl-loop
         for s in students
         collect (plist-get s :email)))
        (students (cl-loop
                 for s in students
                 collect (plist-get s :name)))
       (num  (length emails)))
  
   num
   students
  )
#+end_src

#+RESULTS:
| Rakan Al Nemri | Chloe Bray | Saaged Diab | Ezra Fleisch | Zorah Freeman-McIntyre | Aidan Gowland | Lucy Guo | Erin Holliday | Xi Huang | Keating Johnston | Raja Khan | Eric Lee | Xinyi Luo | Marisa Martel Oh | Edwin Pau | Ahmed Shahab | Min Shin | Paola Shushkovsky | Salina Suri | Rohail Talpur | Harry Twyford | Jackson Whitehead | Ingrid Wong |
